#include <stdio.h>
#include <math.h>
#include <stdlib.h>


int main() {
    double x = 0, f, g1[6], g2[6], t = 0, u[6][6], v = 0.1, h = 0.5;
    for (int i = 0; i <= 5; i++) {
        x = 0.5 * i;
        u[0][i] = -2 * pow(x, 2) + 11.85 + 0.3 * x;
        t = 0.1 * i;
        g1[i] = 0.2 * cos(t) + 0.1;
        g2[i] = 0.1 * atan(t) + 0.1;
    }
    /*
     * 2 способ
     *
     *
     *
     *
     */
    for (int j = 1; j <= 5; j++) {
        for (int i = 1; i < 5; i++) {
            x = 0.5 * i;
            t = 0.1 * (j-1);
            f = (-x + 3) * t - 0.2 * sin(t) * x + 0.1 / (1 + pow(t, 2)) - 2.5 * (-0.2 * sin(t));
            u[j][i] = u[j - 1][i] + (v / pow(h, 2)) * (u[j - 1][i - 1] - 2 * u[j - 1][i] + u[j - 1][i + 1]) + v * f;
        }
        u[j][0] = u[j][1] - h * g1[j];
        u[j][5] = g2[j];
    }
    for (int i = 5; i >= 0; i--) {
        for (int j = 0; j <= 5; j++) {
            printf("%10.7g ", u[i][j]);
        }
        printf("\n");
    }

    printf("%c%c%c",'\n','\n','\n');

    /*
     *
     *
     * 3 способ
     *
     *
     *
     */
    for (int j = 1; j <= 5; j++) {
        u[j][0] = g1[j];
        for (int i = 1; i < 5; i++) {
            x = 0.5 * i;
            t = 0.1 * (1);
            u[j][i] =
                    (-x + 3) * t - 0.2 * sin(t) * x + 0.1 / (1 + pow(t, 2)) - 2.5 * (-0.2 * sin(t)) + u[j - 1][i] / 0.1;
        }
        u[j][1] = (u[j][1] + 2 * u[j][0]) / 14;
        u[j][2] = (u[j][2] + 3.5 * u[j][1]) / 16.85714285;
        u[j][3] = (u[j][3] + 4.214285712 * u[j][2]) / 17.05084745;
        u[j][4] = (u[j][4] + 4.262711863 * u[j][3]) / 17.06163021;
        u[j][5] = g2[j];
        u[j][4] += 0.23444418 * u[j][5];
        u[j][3] += 0.23459244 * u[j][4];
        u[j][2] += 0.23728813 * u[j][3];
        u[j][1] += 0.28571428 * u[j][2];
        u[j][0] += u[j][1];

    }
    for (int i = 5; i >= 0; i--) {
        for (int j = 0; j <= 5; j++) {
            printf("%10.7g ", u[i][j]);
        }
        printf("\n");
    }
}

